export const metadata = {
    title: 'سياسة الاستخدام',
    description: 'الموقع العربي الاول المهتم بصحة النساء',
  };
  
  const PrivacyPolicy = () => {
    return (
      <div className="mx-5 sm:mx-10 mt-10 lg:mx-48 border border-gray-300 p-8">
        <h1 className="text-2xl md:text-3xl font-bold mb-8 text-primary">سياسة الخصوصية</h1>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          شكرًا لاستخدامك "قلقانة". ويهمنا للغاية ثقتكم بنا، ونحن ملتزمون بحماية خصوصية وأمن معلوماتك الشخصية. وتساعدنا المعلومات التي تشاركها معنا في أن نقدم لك تجربة رائعة مع "قلقانة". وتشير سياسة الخصوصية إلى ممارسات الخصوصية التي نتبعها بشأن جميع الخدمات التي نقدمها في جميع أنحاء العالم. يشير مصطلح "قلقانة" أو "لنا" أو "نحن" إلى شركة "قلقانة" المحدودة، بينما يشير مصطلح "المستخدم" و"أنت" و"لك" إلى شخصك بصفك مستخدم لخدمات "قلقانة". وتتضمن سياسة الخصوصية، إلى جانب شروط الاستخدام، القواعد والسياسات العامة التي تحكم استخدامك لمنصتنا. وربما يُطلب منك الموافقة على شروط وأحكام إضافية بناءً على نشاطك عند زيارة منصتنا:
        </p>
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">1. المعلومات التي نجمعها</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          1.1 تلتزم شركة "قلقانة" بالحفاظ على حماية خصوصية مستخدميها. وُوضعت سياسة الخصوصية التي نتبعها من أجل مساعدتك في فهم كيف نقوم بجمع المعلومات التي تزودنا بها واستخدامها وحمايتها. ولدى ولوجك إلى موقع "قلقانة"، نجمع تلقائيًا معلومات معينة حول جهازك، ومنها معلومات حول متصفح الويب الذي تستخدمه، وعنوان بروتوكول الإنترنت، ومنطقتك الزمنية، وبعض ملفات تعريف الارتباط (الكوكيز) المثبتة على جهازك. علاوة على ذلك، بينما تتصفح الموقع، نجمع معلومات حول صفحات الويب الفردية أو الأطباء الذين تشاهدهم، والمواقع الإلكترونية أو مصطلحات البحث التي أحالتك إلى موقع "قلقانة"، والمعلومات حول كيفية تفاعلك مع "قلقانة".
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          1.2 كما نقوم بجمع معلومات منك عند التسجيل على موقع "قلقانة" أو حجز موعد مع أحد الأطباء أو الاشتراك في نشرتنا الإخبارية. وعند الحجز أو التسجيل على موقعنا الإلكتروني، حسبما يكون مناسبًا، قد يُطلب منك إدخال اسمك وعنوان بريدك الإلكتروني وعنوانك البريدي ورقم هاتفك وتاريخ ميلادك ("معلومات شخصية").
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          1.3 قد نطلب منك أيضًا تزويدنا بمعلومات حول تحصيل المدفوعات من بطاقة ائتمانك أو بطاقة الخصم المباشر. وبعد إجراء معاملة ما، لن تُخزن هذه المعلومات الخاصة (بطاقات الائتمان، وأرقام الضمان الاجتماعي، والبيانات المالية، وما إلى ذلك) على خوادمنا.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          1.4 يمكنك أن تطلب منا حذف هذه المعلومات في أي وقت، أو إلغاء الاشتراك من رسائل البريد الإلكتروني من خلال الولوج إلى إعدادات حسابك أو اتباع الإرشادات التفصيلية الواردة أسفل كل رسالة إلكترونية.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">2. كيف نستخدم بياناتك</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          2.1 نستخدم بعض المعلومات التي نجمعها لمساعدتنا في الكشف عن المخاطر المحتملة والاحتيال (لا سيما عنوان بروتوكول الإنترنت الخاص بك)، وبوجه أعم لتحسين موقع "قلقانة" والنهوض به إلى أفضل مستوى (على سبيل المثال، من خلال إنشاء تحليلات حول كيفية تصفح الموقع أو التطبيق عملائنا وتفاعلهم معهما، وكذلك لتقييم نجاح حملاتنا التسويقية والإعلانية).
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          2.2 نستخدم المعلومات الشخصية التي نجمعها بشكل عام لتلبية أي حجوزات تُجرى من خلال "قلقانة"، والتواصل معك، والكشف عن المخاطر المحتملة أو الاحتيال، وتزويدك بالمعلومات أو الإعلانات المتعلقة بمنتجاتنا أو خدماتنا عندما تتماشى المعلومات مع التفضيلات التي شاركتها معنا.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">3. حماية معلوماتك</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          3.1 نحن نسعى جاهدين لحماية معلوماتك عن طريق تطبيق معايير الحماية الدولية واتخاذ مجموعة متنوعة من التدابير الأمنية للحفاظ على سلامة معلوماتك الشخصية عندما تقوم بإجراء حجز أو تدخل معلوماتك الشخصية أو ترسلها أو الوصول إليها.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          3.2 نقوم بفحص موقعنا الإلكتروني وتطبيقنا بانتظام بحثًا عن الثغرات الأمنية ونقاط الضعف وذلك للتأكد من أن زيارتك لموقعنا آمنة قدر المستطاع. ونحمي موقعنا الإلكتروني من خلال جدار حماية تطبيقات الويب الذي يقوم بتصفية ومراقبة حركة المرور بين تطبيق الويب وشبكة الإنترنت. ويكتشف هذا الجدار نقاط الضعف الشائعة في طبقات التطبيق على حافة الشبكة ويحجبها.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          3.3 نحن نوفر خاصية استخدام خادم آمن. وتُرسل جميع المعلومات الحساسة / الائتمانية المقدمة عبر تقنية "بروتوكول طبقة المقبس الآمن" ثم تسجل في قاعدة بيانات "مزودي بوابة الدفع" الخاصة بنا وذلك لكي تكون تلك المعلومات متاحة فقط للأفراد الممنوحين حقوق الولوج الخاصة إلى هذه الأنظمة والذين يُطلب منهم الحفاظ على سرية المعلومات.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          3.4 تُخزن بياناتنا مع مزود خارجي يحمل شهادات وتدقيقات معترف بها في مجال الصناعة، بما في ذلك معيار أمان بيانات صناعة بطاقات الدفع المستوى الأول، ومعيار الآيزو 27001، ومعيار "تأثير معتدل" لقانون إدارة أمن المعلومات الفيدرالي، والبرنامج الفيدرالي لإدارة المخاطر والتفويض، وقانون نقل التأمين الصحي والمساءلة، وتقرير التدقيق لضوابط منظمة الخدمات 1 (يُشار إليها سابقًا باسم بيان معايير التدقيق رقم 70 و / أو البيان الخاص بمعايير مهام التصديق رقم 16) وتقرير التدقيق لضوابط منظمة الخدمات 2.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          3.5 كما نضمن أن جميع بياناتنا محمية بكلمة مرور، ويمكن الوصول إلى تلك البيانات من خلال المصادقة متعددة العوامل. ولا يستطيع جميع أفراد فريق "قلقانة" الوصول إلى أي بيانات يتم جمعها، حيث يُسمح فقط للأفراد الذين لديهم أدوار محددة بالاطلاع على البيانات التي يتم جمعها. عندما تُخزن بياناتك على خوادمنا، فإننا نقدمها باسم مستعار ونشفّرها للحفاظ على إخفاء الهوية وتوفير طبقة إضافية من الأمان في حالة حدوث خرق للبيانات.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">4. إلى متى نحتفظ ببياناتك</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          4.1 المعايير المستخدمة لتحديد فترة تخزين البيانات الشخصية هي فترة الاحتفاظ القانونية المعنية. وبعد انقضاء تلك الفترة، تُحذف البيانات المقابلة بشكل روتيني، لطالما أنها لم تعد ضرورية للاضطلاع بخدماتنا.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          4.2 نقوم بمعالجة وتخزين بياناتك الشخصية للفترة اللازمة لتحقيق الغرض من التخزين فقط. ووفقًا لذلك، إذا كان لدينا عنوان بريدك الإلكتروني لأننا نقدم خدمات معينة لك، فإننا نحتفظ بعنوان البريد الإلكتروني طوال الفترة التي نقدم لك فيها هذه الخدمات.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          4.3 بصورة أساسية، نحتفظ ببياناتك إلى أن يتم حذف حسابك. ويمكنك الاطلاع على البيانات التي نجمعها منك في أي وقت، ويجوز لك أن تطلب حذفها في أي وقت من خلال الولوج إلى إعدادات حسابك.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">5. سياسة استخدام ملفات تعريف الارتباط</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          5.1 ملفات تعريف الارتباط هي ملفات صغيرة ينقلها الموقع أو مزود الخدمة إلى القرص الصلب لجهاز الحاسب الآلي من خلال متصفح الويب الخاص بك (إذا سمحتَ بذلك) والتي تمكن الموقع الإلكتروني أو أنظمة مزودي الخدمة من التعرف على متصفحك والتقاط معلومات معينة وتذكرها.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          5.2 نحن نستخدم ملفات تعريف الارتباط لتحسين تجربتك للتحليلات ولإظهار عروض مصصمة خصيصًا لزياراتك السابقة إلى موقعنا الإلكتروني. كما نستخدم ملفات تعريف الارتباط لمساعدتنا في تجميع البيانات المجمعة حول ارتياد الموقع والتفاعل معه حتى نتمكن من تقديم تجربة مميزة وأدوات أفضل في المستقبل.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          5.3 إذا كنت تفضل ذلك، يمكنك اختيار تفعيل خاصية التحذير في جهاز الحاسوب الخاص بك في كل مرة يتم فيها إرسال ملف تعريف ارتباط، أو يمكنك اختيار إيقاف تشغيل جميع ملفات تعريف الارتباط من خلال الولوج إلى إعدادات المتصفح الخاص بك. وعلى غرار معظم المواقع الإلكترونية، إذا قمتَ بإيقاف تشغيل ملفات تعريف الارتباط، قد لا تعمل بعض خدماتنا على نحو سليم.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">6. عدم الإفصاح عن المعلومات لطرف ثالث</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          6.1 نحن لا نبيع معلوماتك الشخصية المحددة إلى أطراف خارجية ولا نتاجر بها ولا ننقلها بأي طريقة أخرى. ولا يشمل ذلك الأطراف الثالثة الموثوقة التي تساعدنا في تشغيل موقعنا الإلكتروني أو إجراء أعمالنا أو تزويدك بالخدمات، طالما أن هذه الأطراف وافقت على الحفاظ على سرية هذه المعلومات. ويجوز لنا أيضًا الإفصاح عن معلوماتك عندما نرى أن الإفراج عنها يتماشى مع الامتثال بالقانون، أو بغرض تنفيذ سياسات موقعنا، أو حماية حقوقنا أو حقوق الآخرين أو ممتلكاتهم أو لأغراض التسويق أو الإعلان أو غيرها من الأغراض.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          6.2 لن تُخزن كافة تفاصيل الدفع والمعلومات الشخصية محددة الهوية أو تُباع لأي أطراف ثالثة أو تطلع عليها أو تسجيلها لديها.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">7. الإفصاح بشأن منصة "إعلان جوجل ديسبلاي"</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          7.1 نطبق ميزات تحليلات جوجل، أو "جوجل أناليتيكس"، التي تستخدم معلومات "إعلان ديسبلاي" من أجل إعداد تقارير الخصائص الديمغرافية والاهتمامات عبر أداة "جوجل أناليتيكس".
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          7.2 يمكنك إلغاء الاشتراك في أداة "جوجل أناليتيكس" لمنصة "إعلان جوجل ديسبلاي" وذلك لمنع استخدام بياناتك بواسطة أداة "جوجل أناليتيكس"، ويتم ذلك من خلال الانتقال إلى صفحة إلغاء الاشتراك في أداة "جوجل أناليتيكس".
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          7.3 نستخدم ملفات تعريف ارتباط الطرف الأول، جنبًا إلى جنب مع بائعي الطرف الثالث (بما في ذلك شركة جوجل)، (مثل ملفات تعريف ارتباط "جوجل أناليتيكس") وملفات تعريف ارتباط الطرف الثالث (مثل ملفات تعريف الارتباط لبرامج "دبل كليك") وذلك للإبلاغ عن كيفية ارتباط ظهور الإعلان، والاستخدامات الأخرى للخدمات الإعلانية، والتفاعلات مع ظهور الإعلانات والخدمات الإعلانية بزيارة موقعنا الإلكتروني. ويمكنك قراءة المزيد حول ملفات تعريف الارتباط التي تستخدمها مميزات إعلانات "جوجل أناليتيكس" من خلال الانتقال إلى صفحة "سياسة الخصوصية" لمنصة "جوجل أناليتيكس".
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">8. روابط الطرف الثالث</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          8.1 يجوز لنا إدراج أو تقديم منتجات أو خدمات يقدمها طرف ثالث على موقعنا الإلكتروني. وتتبنى مواقع الأطراف الثالثة سياسات خصوصية منفصلة ومستقلة. وبالتالي، لا نتحمل أي مسؤولية أو التزام تجاه محتوى هذه المواقع المتصلة وأنشطتها. ومع ذلك، فإننا نسعى إلى حماية سلامة موقعنا، ونرحب بأي ملاحظات أو تعقيبات حول تلك المواقع. وننصحك بشدة بالاطلاع على سياسة الخصوصية والشروط والأحكام الواردة في كل موقع إلكتروني تزوره.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">9. حقوقك</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          9.1 لديك الحق في الحصول على تأكيد بشأن ما إذا كانت بياناتك الشخصية قيد المعالجة أم لا. ويمكنك الاتصال بنا في أي وقت للمطالبة بهذا الحق.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          9.2 يحق لك طلب المعلومات التي نقوم بمعالجتها حاليًا. كما يمكنك أن تطلب ما يلي لأغراض المعالجة؛ فئات البيانات الشخصية المعنية؛ والجهات المستفيدة أو فئات الجهات المستفيدة التي كُشفت البيانات الشخصية لها أو سيتم الكشف عنها، ولا سيما الجهات المستفيدة المتواجدة في دول ثالثة أو منظمات دولية؛ والمدة المقررة التي ستُخزن البيانات الشخصية خلالها، حيثما أمكن ذلك، أو المعايير المستخدمة لتحديد تلك المدة إذا لم يكن ذلك ممكنًا؛ والحق في طلب تصحيح البيانات الشخصية من وحدة التحكم أو محوها، أو تقييد معالجة البيانات الشخصية المتعلقة بصاحب البيانات، أو الاعتراض على عملية معالجة البيانات؛ والحق في تقديم شكوى إلى هيئة إشرافية؛ وفي حالة عدم جمع البيانات الشخصية من صاحب البيانات، وأي معلومات متاحة من مصدرها.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          9.3 لديك الحق في إبلاغنا بتغير معلوماتك، وعندما لم تعد المعلومات الموجودة لدينا في الملف دقيقة. وبالنظر إلى أغراض المعالجة، تتمتع بالحق في استكمال البيانات الشخصية غير الكاملة، ومنها تقديم بيان تكميلي.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          9.4 لك كل الحق في طلب محو البيانات الشخصية دون تأخير لا مبرر له.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          9.5 يحق لك تلقي البيانات الشخصية المتعلقة بك التي قُدمت إلى وحدة التحكم، في صيغة منظمة وشائعة الاستخدام ومقروءة آليًا.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          9.6 لديك الحق في الاعتراض، في أي وقت، على معالجة بياناتك الشخصية. ولن نعالج البيانات الشخصية في حالة الاعتراض على ذلك، ما لم نجد أسباب مشروعة وقهرية لمعالجة البيانات التي من شأنها أن تحجب مصالحك وحقوقك وحرياتك، أو لرفع الدعاوى القانونية أو ممارستها أو الدفاع عنها.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          9.7 يحق لك سحب موافقتك على معالجة بياناتك الشخصية في أي وقت.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">10. شروط الاستخدام</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          10.1 يُرجى الاطلاع على شروط الاستخدام التي تحدد الاستخدام والتنازلات وحدود المسؤولية التي تحكم استخدام موقعنا الإلكتروني، من خلال زيارة الرابط التالي: <a href="https://www.2l2ana.com" target="_blank" className="text-blue-600 hover:underline">www.2l2ana.com</a>
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">11. موافقتك</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          11.1 أنت توافق على سياسة خصوصيتنا لدى زيارة موقعنا الإلكتروني.
        </p>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          11.2 يجوز تغيير شروط الاستخدام وسياسة الخصوصية الواردة في الموقع الإلكتروني أو تحديثها من حين لآخر لتلبية المتطلبات والمعايير القانونية. لذلك، نود حثك على زيارة هذه الأقسام بشكل متكرر من أجل الاطلاع على التغييرات التي تُجرى في الموقع. وتعتبر التعديلات سارية المفعول في يوم نشرها.
        </p>
  
        <h2 className="text-xl md:text-2xl font-bold mt-8 mb-4 text-primary tajawal-medium">12. الاتصال بنا</h2>
        <p className="text-sm md:text-base mb-4 text-gray-500">
          إذا كان لديك أية استفسارات بخصوص سياسة الخصوصية، يمكنك التواصل معنا عبر البريد الإلكتروني على العنوان التالي: <a href="mailto:customercare@2l2ana.com" className="text-blue-600 hover:underline">customer.care@2l2ana.com</a>
        </p>
      </div>
    );
  };
  
  export default PrivacyPolicy;
  