{
    "HomePage": {
      "title": "Hello world!",
      "about": "Go to the about page"
    },
  "GoalPage": {
  "whoWeAre": "Welcome to",
  "brandName": "Mettamena",
  "slogan": "(Awareness & Health)",
  "tagline": "Your private sanctuary for women's health and well-being",
  "paragraph1": "At Mettamena, we believe that every woman deserves compassionate and specialized care, especially when it comes to sensitive health challenges that are often misunderstood or stigmatized.",
  "paragraph2": "We are a safe and confidential online platform dedicated to supporting Arabic-speaking women facing mental and physical issues such as anxiety, depression, eating disorders (bulimia, anorexia, and binge eating), and sensitive sexual health concerns like vaginismus and sexual trauma.",
  "whyUsTitle": "Why Choose Us?",
  "whyUsPrivacyTitle": "Privacy and Confidentiality First",
  "whyUsPrivacyText": "We understand that privacy is crucial. Our platform is designed to protect your identity and personal information with top-level security, allowing you to seek help from the comfort and safety of your home without fear of judgment or exposure.",
  "whyUsCareTitle": "Specialized and Culturally Sensitive Care",
  "whyUsCareText": "Our team consists of qualified mental health professionals and doctors who deeply understand the cultural and social challenges women face in the Arab world. We provide empathetic and respectful care tailored to your unique needs.",
  "whyUsSupportTitle": "Expert Support for Eating Disorders and Sexual Health",
  "whyUsSupportText": "Eating disorders and sexual health issues are often left undiscussed due to stigma and shame. At Mettamena, we provide specialized consultations and treatment plans to help you overcome challenges such as bulimia, anorexia, vaginismus, and trauma, enabling you to regain your health and confidence.",
  "whyUsCommunityTitle": "Community and Education",
  "whyUsCommunityText": "In addition to one-on-one consultations, we offer educational resources, workshops, and a supportive community where you can learn, share, and grow in a safe and judgment-free environment.",
  "missionTitle": "Our Mission",
  "missionText": "To break the silence around women's mental and sexual health in the Arab world by providing a trusted, safe, and accessible platform that prioritizes your privacy, dignity, and healing journey."
}
,
    "HeroDoctor": {
      "headlinePart1": "Check on your",
      "headlinePart2": "from home with ease!",
      "health": "health",
      "description": "To meet your health needs at the highest levels of care, we offer you a selection of specialized doctors in all fields, available for online consultations via audio and video. Book your appointment now and let us take care of the rest.",
      "exploreDoctors": "Explore Doctors"
    },
    "WhyCard": {
        "headline": "? Why use mettamena",
     "cards": [
  {
    "number": "1",
    "title": "Qualified Experts Without Judgement",
    "paragraph": "Skilled and empathetic professionals provide you with expert support without judgment or stigma."
  },
  {
    "number": "2",
    "title": "Your Privacy is Our Priority",
    "paragraph": "We provide options to protect your confidentiality, without revealing your personal details, and you can turn off the camera during the session."
  },
  {
    "number": "3",
    "title": "Deep Understanding of Your Case",
    "paragraph": "We focus on explaining your medical and psychological case clearly to help you understand it without complexity."
  },
  {
    "number": "4",
    "title": "24/7 Support Available",
    "paragraph": "Our platform is here for you anytime, so you can get the support you need instantly."
  }
]

      },
      "OfflineSection": {
        "headline": "Some Conditions That Can Be Treated Via Telehealth Services",
        "subtext": "Ask doctors about most health conditions without leaving your home",
  "cases": [
  {
    "title": "Mental Health",
    "lists": [
      "Anxiety disorders",
      "Mild to moderate depression",
      "Sleep disorders",
      "Daily life and relationship stress",
      "Panic attacks and fear",
      "Mood swings related to menstruation / pregnancy / postpartum",
      "Post-traumatic stress disorder (PTSD)"
    ]
  },
  {
    "title": "Eating and Nutrition Disorders",
    "lists": [
      "Emotional or compulsive eating",
      "Loss of appetite or binge eating",
      "Distorted body image",
      "Creating personal nutrition plans",
      "Digestive issues or bloating",
      "Nutrition during pregnancy or breastfeeding",
      "Healthy weight loss or gain"
    ]
  },
  {
    "title": "Psychosexual Issues",
    "lists": [
      "Desire disorders",
      "Arousal and orgasm issues",
      "Pain during intercourse",
      "Vaginismus"
    ]
  }
]

      },
      "ArticleCard": {
        "title": "Confused about a question? Send your medical queries now",
        "seeQuestions": "See other questions",
        "askQuestion": "Ask your question"
      },
     "AdsSection": {
  "title": "What Our Clients Say About Mettamena",
  "description": "Because your opinion matters and we take it into account every step of the way"
},
      "Learning": {
    "title": "Learning and Awareness",
    "description": "Learn and explore more about your physical and mental health through mettamena's medical content"
  }, "Footer": {
    "bookDoctor": "Book the best doctor",
    "specialist1": "Gynecologist",
    "specialist2": "Psychologist",
    "specialist3": "Addiction and Psychiatric Doctor",
    "moreSpecialists": "More specialties",
    "followUs": "Follow Us",
    "ourServices": "Our Services",
    "medicalArticles": "Medical Articles",
    "medicalVideos": "Medical Videos",
    "podcast": "mettamena Podcast",
    "medicalQuestions": "Medical Questions",
    "askUs": "Ask Us?",
    "aboutUs": "About Us",
    "whoWeAre": "Who We Are",
    "termsOfUse": "Terms of Use",
    "contactUs": "Contact us via:",
    "email": "Email",
    "whatsapp": "WhatsApp",
    "rights": "All rights reserved."
  },
  "Newsletter": {
    "heading": "Guides | Videos | Medical Articles",
    "description": "Join over 5000 members! Subscribe now for the latest blogs, answers to your questions, and updates on women's health. Stay informed and connected with us!"
  },
  "RecentPosts": {
    "noPosts": "No recent posts available.",
    "header": "Articles",
    "latestPosts": "Latest Posts",
    "more": "More"
  },
  
  "Header": {
    "home": "Home",
    "medicalContent": "Medical Content",
    "blogs": "Medical Articles",
    "videos": "Medical Videos",
    "podcasts": "mettamena Podcast",
    "medicalQuestions": "Medical Questions",
    "askDoctor": "Send Us Your Question",
    "bookDoctor": "Book a Doctor",
    "aboutUs": "About Us",
    "store": "Store",
    "comingSoon": "Coming Soon"
  }, 
   "LoginAccount": {
    "home": "Home",
    "myProfile": "My Profile",
    "myBookings": "My Bookings",
    "medicalContent": "Medical Content",
    "blogs": "Medical Articles",
    "videos": "Medical Videos",
    "podcasts": "mettamena Podcast",
    "medicalQuestions": "Medical Questions",
    "askDoctor": "Send Us Your Question",
    "bookDoctor": "Book a Doctor",
    "aboutUs": "About Us",
    "logout": "Logout",
    "login": "Login",
    "register": "Register"
  },
   "SearchDoctorBar": {
    "searchFavoriteDoctor": "Search for your ",
    "yourDoctor": "favorite Doctor",
"doctorDescription": "A group of elite doctors and specialists in various fields, ready to provide safe and private consultations through video or audio sessions only. Choose comfort and medical support from anywhere that suits you."
   , "searchPlaceholder": "Search",
    "searchButton": "Search",
    "allSpecialties": "All Specialties"
  },
  "DoctorList": {
    "noDoctorsFound": "No doctors found matching your criteria.",
    "generalSpecialty": "General Specialty",
    "consultationPrice": "Consultation Price",
    "currency": "EGP",
    "bookNow": "Book Now"
  },
  "LoginForm": {
    "emailLabel": "Email",
    "passwordLabel": "Password",
    "forgotPassword": "Forgot password?",
    "login": "Login",
    "noAccount": "Don't have an account?",
    "registerNow": "Register now",
    "invalidLogin": "Invalid email or password. Please try again."
  },
  "RegisterForm": {
    "emailInvalid": "Please enter a valid email address",
    "passwordMin": "Password must be at least 6 characters",
    "nameMin": "Name must include both first and last name",
    "nameRequired": "Name must include a first name, space, and last name (e.g., 'John Doe')",
    "phoneInvalid": "Phone number must be valid",
    "emailConflict": "The email is already in use. Please log in.",
    "registrationError": "An error occurred during registration. Please try again.",
    "nameLabel": "Name",
    "emailLabel": "Email",
    "passwordLabel": "Password",
    "phoneLabel": "Phone Number",
    "submitting": "Creating account...",
    "register": "Register",
    "alreadyHaveAccount": "Already have an account?",
    "loginNow": "Log in now",
    "termsOfUse": "Terms of Use"
  },
  "LoginLayout": {
    "communityText": "The largest women's health community in the Arab world"
  },
  "PrivacyPolicy": {
    "title": "سياسة الخصوصية",
    "intro": "شكرًا لاستخدامك \"mettamena\". ويهمنا للغاية ثقتكم بنا، ونحن ملتزمون بحماية خصوصية وأمن معلوماتك الشخصية. وتساعدنا المعلومات التي تشاركها معنا في أن نقدم لك تجربة رائعة مع \"mettamena\". وتشير سياسة الخصوصية إلى ممارسات الخصوصية التي نتبعها بشأن جميع الخدمات التي نقدمها في جميع أنحاء العالم. يشير مصطلح \"mettamena\" أو \"لنا\" أو \"نحن\" إلى شركة \"mettamena\" المحدودة، بينما يشير مصطلح \"المستخدم\" و\"أنت\" و\"لك\" إلى شخصك بصفك مستخدم لخدمات \"mettamena\". وتتضمن سياسة الخصوصية، إلى جانب شروط الاستخدام، القواعد والسياسات العامة التي تحكم استخدامك لمنصتنا. وربما يُطلب منك الموافقة على شروط وأحكام إضافية بناءً على نشاطك عند زيارة منصتنا:",
    "section1": "1. المعلومات التي نجمعها\n\n 1.1 تلتزم شركة \"mettamena\" بالحفاظ على حماية خصوصية مستخدميها. وُوضعت سياسة الخصوصية التي نتبعها من أجل مساعدتك في فهم كيف نقوم بجمع المعلومات التي تزودنا بها واستخدامها وحمايتها. ولدى ولوجك إلى موقع \"mettamena\"، نجمع تلقائيًا معلومات معينة حول جهازك، ومنها معلومات حول متصفح الويب الذي تستخدمه، وعنوان بروتوكول الإنترنت، ومنطقتك الزمنية، وبعض ملفات تعريف الارتباط (الكوكيز) المثبتة على جهازك. علاوة على ذلك، بينما تتصفح الموقع، نجمع معلومات حول صفحات الويب الفردية أو الأطباء الذين تشاهدهم، والمواقع الإلكترونية أو مصطلحات البحث التي أحالتك إلى موقع \"mettamena\"، والمعلومات حول كيفية تفاعلك مع \"mettamena\".\n\n 1.2 كما نقوم بجمع معلومات منك عند التسجيل على موقع \"mettamena\" أو حجز موعد مع أحد الأطباء أو الاشتراك في نشرتنا الإخبارية. وعند الحجز أو التسجيل على موقعنا الإلكتروني، حسبما يكون مناسبًا، قد يُطلب منك إدخال اسمك وعنوان بريدك الإلكتروني وعنوانك البريدي ورقم هاتفك وتاريخ ميلادك (\"معلومات شخصية\").\n\n 1.3 قد نطلب منك أيضًا تزويدنا بمعلومات حول تحصيل المدفوعات من بطاقة ائتمانك أو بطاقة الخصم المباشر. وبعد إجراء معاملة ما، لن تُخزن هذه المعلومات الخاصة (بطاقات الائتمان، وأرقام الضمان الاجتماعي، والبيانات المالية، وما إلى ذلك) على خوادمنا.\n\n 1.4 يمكنك أن تطلب منا حذف هذه المعلومات في أي وقت، أو إلغاء الاشتراك من رسائل البريد الإلكتروني من خلال الولوج إلى إعدادات حسابك أو اتباع الإرشادات التفصيلية الواردة أسفل كل رسالة إلكترونية.",
    "section2": "2. كيف نستخدم بياناتك\n\n 2.1 نستخدم بعض المعلومات التي نجمعها لمساعدتنا في الكشف عن المخاطر المحتملة والاحتيال (لا سيما عنوان بروتوكول الإنترنت الخاص بك)، وبوجه أعم لتحسين موقع \"mettamena\" والنهوض به إلى أفضل مستوى (على سبيل المثال، من خلال إنشاء تحليلات حول كيفية تصفح الموقع أو التطبيق عملائنا وتفاعلهم معهما، وكذلك لتقييم نجاح حملاتنا التسويقية والإعلانية).\n\n 2.2 نستخدم المعلومات الشخصية التي نجمعها بشكل عام لتلبية أي حجوزات تُجرى من خلال \"mettamena\"، والتواصل معك، والكشف عن المخاطر المحتملة أو الاحتيال، وتزويدك بالمعلومات أو الإعلانات المتعلقة بمنتجاتنا أو خدماتنا عندما تتماشى المعلومات مع التفضيلات التي شاركتها معنا.",
    "section3": "3. حماية معلوماتك\n\n 3.1 نحن نسعى جاهدين لحماية معلوماتك عن طريق تطبيق معايير الحماية الدولية واتخاذ مجموعة متنوعة من التدابير الأمنية للحفاظ على سلامة معلوماتك الشخصية عندما تقوم بإجراء حجز أو تدخل معلوماتك الشخصية أو ترسلها أو الوصول إليها.\n\n 3.2 نقوم بفحص موقعنا الإلكتروني وتطبيقنا بانتظام بحثًا عن الثغرات الأمنية ونقاط الضعف وذلك للتأكد من أن زيارتك لموقعنا آمنة قدر المستطاع. ونحمي موقعنا الإلكتروني من خلال جدار حماية تطبيقات الويب الذي يقوم بتصفية ومراقبة حركة المرور بين تطبيق الويب وشبكة الإنترنت. ويكتشف هذا الجدار نقاط الضعف الشائعة في طبقات التطبيق على حافة الشبكة ويحجبها.\n\n 3.3 نحن نوفر خاصية استخدام خادم آمن. وتُرسل جميع المعلومات الحساسة / الائتمانية المقدمة عبر تقنية \"بروتوكول طبقة المقبس الآمن\" ثم تسجل في قاعدة بيانات \"مزودي بوابة الدفع\" الخاصة بنا وذلك لكي تكون تلك المعلومات متاحة فقط للأفراد الممنوحين حقوق الولوج الخاصة إلى هذه الأنظمة والذين يُطلب منهم الحفاظ على سرية المعلومات.\n\n 3.4 تُخزن بياناتنا مع مزود خارجي يحمل شهادات وتدقيقات معترف بها في مجال الصناعة، بما في ذلك معيار أمان بيانات صناعة بطاقات الدفع المستوى الأول، ومعيار الآيزو 27001، ومعيار \"تأثير معتدل\" لقانون إدارة أمن المعلومات الفيدرالي، والبرنامج الفيدرالي لإدارة المخاطر والتفويض، وقانون نقل التأمين الصحي والمساءلة.\n\n 3.5 كما نضمن أن جميع بياناتنا محمية بكلمة مرور، ويمكن الوصول إلى تلك البيانات من خلال المصادقة متعددة العوامل.",
    "section4": "4. إلى متى نحتفظ ببياناتك\n\n 4.1 المعايير المستخدمة لتحديد فترة تخزين البيانات الشخصية هي فترة الاحتفاظ القانونية المعنية. وبعد انقضاء تلك الفترة، تُحذف البيانات المقابلة بشكل روتيني، لطالما أنها لم تعد ضرورية للاضطلاع بخدماتنا.\n\n 4.2 نقوم بمعالجة وتخزين بياناتك الشخصية للفترة اللازمة لتحقيق الغرض من التخزين فقط. ووفقًا لذلك، إذا كان لدينا عنوان بريدك الإلكتروني لأننا نقدم خدمات معينة لك، فإننا نحتفظ بعنوان البريد الإلكتروني طوال الفترة التي نقدم لك فيها هذه الخدمات.\n\n 4.3 بصورة أساسية، نحتفظ ببياناتك إلى أن يتم حذف حسابك. ويمكنك الاطلاع على البيانات التي نجمعها منك في أي وقت، ويجوز لك أن تطلب حذفها في أي وقت من خلال الولوج إلى إعدادات حسابك.",
    "section5": "5. سياسة استخدام ملفات تعريف الارتباط\n\n 5.1 ملفات تعريف الارتباط هي ملفات صغيرة ينقلها الموقع أو مزود الخدمة إلى القرص الصلب لجهاز الحاسب الآلي من خلال متصفح الويب الخاص بك (إذا سمحتَ بذلك) والتي تمكن الموقع الإلكتروني أو أنظمة مزودي الخدمة من التعرف على متصفحك والتقاط معلومات معينة وتذكرها.\n\n 5.2 نحن نستخدم ملفات تعريف الارتباط لتحسين تجربتك للتحليلات ولإظهار عروض مصصمة خصيصًا لزياراتك السابقة إلى موقعنا الإلكتروني. كما نستخدم ملفات تعريف الارتباط لمساعدتنا في تجميع البيانات المجمعة حول ارتياد الموقع والتفاعل معه حتى نتمكن من تقديم تجربة مميزة وأدوات أفضل في المستقبل.\n\n 5.3 إذا كنت تفضل ذلك، يمكنك اختيار تفعيل خاصية التحذير في جهاز الحاسوب الخاص بك في كل مرة يتم فيها إرسال ملف تعريف ارتباط، أو يمكنك اختيار إيقاف تشغيل جميع ملفات تعريف الارتباط من خلال الولوج إلى إعدادات المتصفح الخاص بك.",
    "section6": "6. عدم الإفصاح عن المعلومات لطرف ثالث\n\n 6.1 نحن لا نبيع معلوماتك الشخصية المحددة إلى أطراف خارجية ولا نتاجر بها ولا ننقلها بأي طريقة أخرى. ولا يشمل ذلك الأطراف الثالثة الموثوقة التي تساعدنا في تشغيل موقعنا الإلكتروني أو إجراء أعمالنا أو تزويدك بالخدمات، طالما أن هذه الأطراف وافقت على الحفاظ على سرية هذه المعلومات.\n\n 6.2 لن تُخزن كافة تفاصيل الدفع والمعلومات الشخصية محددة الهوية أو تُباع لأي أطراف ثالثة أو تطلع عليها أو تسجيلها لديها.",
    "section7": "7. الإفصاح بشأن منصة \"إعلان جوجل ديسبلاي\"\n\n 7.1 نطبق ميزات تحليلات جوجل، أو \"جوجل أناليتيكس\"، التي تستخدم معلومات \"إعلان ديسبلاي\" من أجل إعداد تقارير الخصائص الديمغرافية والاهتمامات عبر أداة \"جوجل أناليتيكس\".\n\n 7.2 يمكنك إلغاء الاشتراك في أداة \"جوجل أناليتيكس\" لمنصة \"إعلان جوجل ديسبلاي\" وذلك لمنع استخدام بياناتك بواسطة أداة \"جوجل أناليتيكس\".\n\n 7.3 نستخدم ملفات تعريف ارتباط الطرف الأول جنبًا إلى جنب مع بائعي الطرف الثالث.",
    "section8": "8. روابط الطرف الثالث\n\n 8.1 يجوز لنا إدراج أو تقديم منتجات أو خدمات يقدمها طرف ثالث على موقعنا الإلكتروني. وتتبنى مواقع الأطراف الثالثة سياسات خصوصية منفصلة ومستقلة. وبالتالي، لا نتحمل أي مسؤولية أو التزام تجاه محتوى هذه المواقع المتصلة وأنشطتها.",
    "section9": "9. حقوقك\n\n 9.1 لديك الحق في الحصول على تأكيد بشأن ما إذا كانت بياناتك الشخصية قيد المعالجة أم لا.\n\n 9.2 يحق لك طلب المعلومات التي نقوم بمعالجتها حاليًا. كما يمكنك أن تطلب ما يلي لأغراض المعالجة؛ فئات البيانات الشخصية المعنية؛ والجهات المستفيدة أو فئات الجهات المستفيدة التي كُشفت البيانات الشخصية لها أو سيتم الكشف عنها، ولا سيما الجهات المستفيدة المتواجدة في دول ثالثة أو منظمات دولية.\n\n 9.3 لديك الحق في إبلاغنا بتغير معلوماتك، وعندما لم تعد المعلومات الموجودة لدينا في الملف دقيقة. وبالنظر إلى أغراض المعالجة، تتمتع بالحق في استكمال البيانات الشخصية غير الكاملة.\n\n 9.4 لك كل الحق في طلب محو البيانات الشخصية دون تأخير لا مبرر له.\n\n 9.5 يحق لك تلقي البيانات الشخصية المتعلقة بك التي قُدمت إلى وحدة التحكم، في صيغة منظمة وشائعة الاستخدام ومقروءة آليًا.\n\n 9.6 لديك الحق في الاعتراض، في أي وقت، على معالجة بياناتك الشخصية.\n\n 9.7 يحق لك سحب موافقتك على معالجة بياناتك الشخصية في أي وقت.",
    "section10": "10. شروط الاستخدام\n\n 10.1 يُرجى الاطلاع على شروط الاستخدام التي تحدد الاستخدام والتنازلات وحدود المسؤولية التي تحكم استخدام موقعنا الإلكتروني.",
    "section11": "11. موافقتك\n\n 11.1 أنت توافق على سياسة خصوصيتنا لدى زيارة موقعنا الإلكتروني.\n\n 11.2 يجوز تغيير شروط الاستخدام وسياسة الخصوصية الواردة في الموقع الإلكتروني أو تحديثها من حين لآخر لتلبية المتطلبات والمعايير القانونية.",
    "section12": "12. الاتصال بنا\n\n إذا كان لديك أية استفسارات بخصوص سياسة الخصوصية، يمكنك التواصل معنا عبر البريد الإلكتروني."
  },"BookAppointment": {
    "book": "Book an Appointment",
    "selectDay": "Select Day",
    "selectTime": "Select Time (Cairo Time)",
    "fullyBooked": "All slots are booked, would you like to see another doctor?",
    "findAnotherDoctor": "Find another doctor",
    "loginRequired": "You need to log in to proceed",
    "login": "Login",
    "oneStepLeft": "One step left to complete the booking",
    "selectedDay": "Selected Day",
    "selectedDate": "Selected Date",
    "selectedTime": "Selected Time (Cairo Time)",
    "goToPayment": "Go to payment for 30 minutes",
    "free30Min": "Free 30 Minutes",
    "free10Min": "Free 10 Minutes",
    "success": "Congratulations, the appointment has been successfully booked!",
    "paymentPending": "After completing the payment, you'll find your booking details in My Bookings",
    "myBookings": "My Bookings"
  },
  "daysOfWeek": {
    "sunday": "Sunday",
    "monday": "Monday",
    "tuesday": "Tuesday",
    "wednesday": "Wednesday",
    "thursday": "Thursday",
    "friday": "Friday",
    "saturday": "Saturday"
  },
  "or": "or",
  "next": "Next",
  "back": "Back",
  "close": "Close",
  "MyBookings": {
    "myBookings": "My Bookings",
    "operationSuccess": "Operation successful",
    "operationFailed": "Operation failed, please try again",
    "userNotAuthenticated": "User is not authenticated",
    "fetchFailed": "Failed to fetch data",
    "fetchDoctorFailed": "Failed to fetch details for doctor {{doctorId}}",
    "ratingFailed": "Failed to submit rating",
    "doctorDuties": "Doctor Duties.pdf",
    "medicalConsent": "Medical Consent.pdf",
    "doctorConsentNote": "By entering the meeting, you agree to the medical terms.",
    "patientConsentNote": "By entering the meeting, you agree to the medical terms.",
    "upcoming": "Upcoming",
    "pastBookings": "Past Bookings",
    "noUpcomingBookings": "No upcoming bookings",
    "bookNow": "Book now",
    "helpMessage": "Need help? Contact us via"
  }, "RecentPodcast": {
    "titleHome": "mettamena Podcast",
    "titleWatchAlso": "Watch Also",
    "noPodcasts": "No podcasts available.",
    "errorLoading": "Error loading podcasts."
  },"RecentPost": {
    "noVideos": "No videos available.",
    "videos": "Videos",
    "latestVideos": "Latest Videos",
    "more": "More"
  }, "FeaturedPosts": {
    "mostPopular": "Most Popular",
    "errorFetching": "Error fetching videos."
  },"CoverSection": {
    "videos": "Videos",
    "errorLoadingVideo": "Error loading video",
      "consultationLink": "Confused about a consultation? Book a voice or video call now with the best doctors  from your home.",
    "podcast": "Podcast",
    "errorLoadingPodcast": "Error loading podcast",
    "articles": "Articles",
    "errorLoadingBlog": "Error loading blog",
    "noImageAvailable": "No Image Available",
    "uncategorized": "Uncategorized"
  }, "FeaturePosts": {
    "mostPopular": "Most Popular",
    "errorFetchingBlogs": "Error fetching blogs."
  }, "DoctoorBoster": {
    "onlineConsultation": "Your online consultation with the best doctor, anytime any place",
    "seeDoctors": "See Doctors",
    "doctorImageAlt": "Doctor"
  },  "HeroQestion": {
    "title": "Send your medical inquiries",
    "subtitle": "& get your answers",
    "description": "Because your health is our top priority, we provide a specialized team to answer all your medical inquiries.",
    "askButton": "Send your question",
    "bookButton": "Book with a doctor"
  },  "AskDoctor": {
    "successMessage": "Your question has been submitted successfully! We'll respond soon. Thank you for using Qalaqana!",
    "askAnotherQuestion": "Ask another question?",
    "bookOnlineNow": "Book with a doctor online now",
    "askYourQuestion": "Ask your question now and reach thousands of doctors",
    "description": "Get an answer to your question within 48 hours, or subscribe to mettamena for an instant and private consultation with a certified doctor.",
    "talkToDoctorNow": "Talk to a doctor now",
    "questionTitlePlaceholder": "Question title (a brief summary of your health problem)",
    "questionContentPlaceholder": "Question content (explain all your inquiries)",
    "selectTag": "Select a category for the question",
    "selectTagPlaceholder": "Select a tag",
    "errorTitle": "Question title is required",
    "errorContent": "Question content is required",
    "errorTag": "Please select a category",
    "warning": "After submitting, your question will be made public, so be cautious and remove any private information.",
    "submit": "Submit",
    "emergencyMessage": "If it's a medical emergency, we recommend visiting the nearest emergency center."
  }, "Details": {
    "generalSpeciality": "General Speciality",
    "consultationPrice": "Consultation Price",
    "currency": "EGP",
    "doctorInfo": "Doctor Information",
    "noAdditionalInfo": "No additional information available."
  },  "FileManagement": {
    "keepAll": "Keep all your",
    "yourMedicalData": "medical data",
    "inOnePlace": "in one place easily and securely.",
    "tooltipInfo": "Your medical data is fully secure. Only your subscribed doctors can view your medical files.",
    "fetchError": "Error fetching medical files.",
    "deleteSuccess": "File deleted successfully.",
    "deleteError": "Error deleting file.",
    "loading": "Loading..."
  }, "MyProfile": {
    "unauthorizedUser": "Unauthorized user",
    "fetchUserFailed": "Failed to fetch user data",
    "fetchUserError": "An error occurred while fetching user data"
  },  "UpdatePhoneNumberForm": {
    "updatePhoneNumber": "Update Phone Number",
    "editPhoneNumber": "Edit Phone Number",
    "unauthorizedUser": "Unauthorized user",
    "fetchUserFailed": "Failed to fetch user data",
    "fetchUserError": "An error occurred while fetching user data",
    "phoneNumberMinLength": "Phone number must be at least 5 digits.",
    "phoneNumberUpdateSuccess": "Phone number updated successfully",
    "phoneNumberUpdateFailed": "Failed to update phone number",
    "phoneNumberUpdateError": "An error occurred while updating the phone number"
  },"FileUpload": {
    "uploadButton": "Upload Files (Images or PDF Files)",
    "uploadingFiles": "Uploading files ...",
    "uploadError": "Error uploading file.",
    "uploadSuccess": "Medical file uploaded successfully.",
    "uploadFileFailed": "Failed to upload file.",
    "uploadMedicalInfoFailed": "Failed to upload medical file info.",
    "medicalFileInfoError": "Error uploading medical file info."
  }, "FilePreview": {
    "pdfFile": "PDF",
    "download": "Download",
    "fullSize": "Full Size"
  }
  }
  